report/stage_6/profiling/async_limited/wrk2_async_fixed_put.txt
$ wrk2 -c 128 -t 8 -d 65s -R 20000 -L -s ./scripts/put.lua http://localhost:8080/ >> output/wrk2_async_fixed_put.txt


Running 1m test @ http://localhost:8080/
  8 threads and 128 connections
  Thread calibration: mean lat.: 1.842ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.528ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.631ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.380ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.528ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.419ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.553ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.653ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.71ms   39.89ms   1.05s    99.47%
    Req/Sec     2.64k   420.65    14.80k    92.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.07ms
 75.000%    1.46ms
 90.000%    1.87ms
 99.000%   14.92ms
 99.900%  799.74ms
 99.990%    1.00s 
 99.999%    1.03s 
100.000%    1.05s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.037     0.000000            1         1.00
       0.430     0.100000       110068         1.11
       0.608     0.200000       219947         1.25
       0.768     0.300000       330230         1.43
       0.917     0.400000       439591         1.67
       1.066     0.500000       549919         2.00
       1.141     0.550000       604791         2.22
       1.217     0.600000       659414         2.50
       1.296     0.650000       714429         2.86
       1.377     0.700000       769322         3.33
       1.463     0.750000       824071         4.00
       1.510     0.775000       851710         4.44
       1.560     0.800000       878779         5.00
       1.617     0.825000       906333         5.71
       1.683     0.850000       933722         6.67
       1.764     0.875000       961240         8.00
       1.812     0.887500       974975         8.89
       1.869     0.900000       988768        10.00
       1.935     0.912500      1002337        11.43
       2.021     0.925000      1016104        13.33
       2.141     0.937500      1029927        16.00
       2.225     0.943750      1036721        17.78
       2.341     0.950000      1043548        20.00
       2.513     0.956250      1050412        22.86
       2.769     0.962500      1057233        26.67
       3.189     0.968750      1064118        32.00
       3.495     0.971875      1067533        35.56
       3.931     0.975000      1070972        40.00
       4.555     0.978125      1074395        45.71
       5.611     0.981250      1077825        53.33
       7.347     0.984375      1081260        64.00
       8.655     0.985938      1082979        71.11
      10.503     0.987500      1084691        80.00
      13.055     0.989062      1086408        91.43
      16.431     0.990625      1088125       106.67
      20.591     0.992188      1089844       128.00
      23.327     0.992969      1090697       142.22
      27.487     0.993750      1091557       160.00
      38.111     0.994531      1092415       182.86
      90.431     0.995313      1093272       213.33
     177.023     0.996094      1094132       256.00
     226.175     0.996484      1094560       284.44
     315.391     0.996875      1094988       320.00
     404.735     0.997266      1095417       365.71
     493.567     0.997656      1095846       426.67
     584.191     0.998047      1096278       512.00
     627.711     0.998242      1096490       568.89
     673.279     0.998437      1096705       640.00
     717.311     0.998633      1096921       731.43
     761.343     0.998828      1097136       853.33
     804.863     0.999023      1097348      1024.00
     826.879     0.999121      1097455      1137.78
     847.871     0.999219      1097563      1280.00
     870.399     0.999316      1097671      1462.86
     892.927     0.999414      1097777      1706.67
     914.431     0.999512      1097887      2048.00
     924.159     0.999561      1097939      2275.56
     935.423     0.999609      1097993      2560.00
     946.175     0.999658      1098045      2925.71
     957.439     0.999707      1098100      3413.33
     968.191     0.999756      1098153      4096.00
     974.335     0.999780      1098182      4551.11
     979.967     0.999805      1098206      5120.00
     985.087     0.999829      1098233      5851.43
     990.207     0.999854      1098260      6826.67
     995.839     0.999878      1098286      8192.00
     999.423     0.999890      1098301      9102.22
    1001.983     0.999902      1098315     10240.00
    1005.055     0.999915      1098329     11702.86
    1007.103     0.999927      1098341     13653.33
    1010.175     0.999939      1098354     16384.00
    1011.199     0.999945      1098361     18204.44
    1012.223     0.999951      1098367     20480.00
    1014.783     0.999957      1098377     23405.71
    1015.295     0.999963      1098380     27306.67
    1018.367     0.999969      1098388     32768.00
    1018.879     0.999973      1098391     36408.89
    1019.903     0.999976      1098395     40960.00
    1021.439     0.999979      1098398     46811.43
    1021.951     0.999982      1098400     54613.33
    1025.535     0.999985      1098404     65536.00
    1026.047     0.999986      1098406     72817.78
    1026.559     0.999988      1098407     81920.00
    1027.583     0.999989      1098409     93622.86
    1028.095     0.999991      1098410    109226.67
    1029.119     0.999992      1098412    131072.00
    1030.143     0.999993      1098413    145635.56
    1032.191     0.999994      1098414    163840.00
    1032.703     0.999995      1098416    187245.71
    1032.703     0.999995      1098416    218453.33
    1032.703     0.999996      1098416    262144.00
    1033.727     0.999997      1098417    291271.11
    1033.727     0.999997      1098417    327680.00
    1037.311     0.999997      1098418    374491.43
    1037.311     0.999998      1098418    436906.67
    1037.311     0.999998      1098418    524288.00
    1042.943     0.999998      1098419    582542.22
    1042.943     0.999998      1098419    655360.00
    1042.943     0.999999      1098419    748982.86
    1042.943     0.999999      1098419    873813.33
    1042.943     0.999999      1098419   1048576.00
    1047.039     0.999999      1098420   1165084.44
    1047.039     1.000000      1098420          inf
#[Mean    =        3.706, StdDeviation   =       39.887]
#[Max     =     1046.528, Total count    =      1098420]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1299259 requests in 1.08m, 102.16MB read
  Non-2xx or 3xx responses: 692433
Requests/sec:  19989.19
Transfer/sec:      1.57MB